# 创建商品服务所需数据
CREATE DATABASE /*!32312 IF NOT EXISTS */`taoduoduo_mall_cloud_goods_db` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `taoduoduo_mall_cloud_goods_db`;

# 创建商品分类表

DROP TABLE IF EXISTS `tb_taoduoduo_mall_category`;

CREATE TABLE `tb_taoduoduo_mall_category`
(
    `category_id`    bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT '分类id',
    `category_level` tinyint(4)          NOT NULL DEFAULT '0' COMMENT '分类级别(1-一级分类 2-二级分类 3-三级分类)',
    `parent_id`      bigint(20) unsigned NOT NULL DEFAULT '0' COMMENT '父分类id',
    `category_name`  varchar(50)         NOT NULL DEFAULT '' COMMENT '分类名称',
    `category_rank`  int(11)             NOT NULL DEFAULT '0' COMMENT '排序值(字段越大越靠前)',
    `is_deleted`     tinyint             NOT NULL DEFAULT '0' COMMENT '删除标识字段(0-未删除 1-已删除)',
    `create_time`    timestamp           NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
    `create_user`    bigint(11) unsigned NOT NULL DEFAULT '0' COMMENT '创建者id',
    `update_time`    timestamp           NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '修改时间',
    `update_user`    bigint(11) unsigned          DEFAULT '0' COMMENT '修改者id',
    PRIMARY KEY (`category_id`) USING BTREE
) ENGINE = InnoDB
  DEFAULT CHARSET = utf8
  ROW_FORMAT = DYNAMIC;

# 新增商品分类数据

INSERT INTO tb_taoduoduo_mall_category (category_level, parent_id, category_name, category_rank, is_deleted,
                                        create_time, create_user, update_time, update_user)
VALUES (1, 0, '家电 数码 手机', 100, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '女装 男装 穿搭', 99, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 15, '家电', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 15, '数码', 9, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 15, '手机', 8, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '生活电器', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '厨房电器', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '扫地机器人', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '吸尘器', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '取暖器', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '豆浆机', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '暖风机', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '加湿器', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '蓝牙音箱', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '烤箱', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '卷发器', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, '空气净化器', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '游戏主机', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '数码精选', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '平板电脑', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '苹果 Apple', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '电脑主机', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '数码相机', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '电玩动漫', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '单反相机', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '键盘鼠标', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '无人机', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '二手电脑', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 18, '二手手机', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, 'iPhone 11', 89, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '荣耀手机', 99, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '华为手机', 98, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '苹果 iPhone', 88, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '华为 Mate 20', 79, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '华为 P30', 97, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '华为 P30 Pro', 0, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '小米手机', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '红米', 0, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, 'OPPO', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '一加', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '小米 MIX', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, 'Reno', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, 'vivo', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 19, '手机以旧换新', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '运动 户外 乐器', 97, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '游戏 动漫 影视', 96, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '家具 家饰 家纺', 98, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '美妆 清洁 宠物', 94, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '工具 装修 建材', 93, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, 'test12', 0, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '玩具 孕产 用品', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '鞋靴 箱包 配件', 91, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 16, '女装', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 16, '男装', 9, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 16, '穿搭', 8, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 61, '家具', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 61, '家饰', 9, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 61, '家纺', 8, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 59, '运动', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 59, '户外', 9, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 59, '乐器', 8, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 67, '外套', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 70, '沙发', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 73, '跑鞋', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 60, '游戏', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 60, '动漫', 9, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 60, '影视', 8, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 79, 'LOL', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 62, '美妆', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 62, '宠物', 9, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 62, '清洁', 8, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 83, '口红', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 63, '工具', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 63, '装修', 9, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 63, '建材', 8, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 87, '转换器', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 64, '珠宝', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 64, '金饰', 9, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 64, '眼镜', 8, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 91, '钻石', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 66, '鞋靴', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 66, '箱包', 9, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 66, '配件', 8, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 95, '休闲鞋', 10, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 83, '气垫', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 83, '美白', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 83, '隔离霜', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 83, '粉底', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 83, '腮红', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 83, '睫毛膏', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 83, '香水', 0, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 83, '面膜', 0, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '2344', 1, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '测试分类', 50, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 15, 'xxx', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 17, 'wer', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '测试分类2', 255, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 111, '测试分类2-1', 0, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '商品类目1', 200, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '商品类目1', 200, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 65, '玩具', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (3, 115, '机器人', 0, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '测试', 10000, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 1, '你好', 100000, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 1, '1', 22222, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 2, '1', 111111, 0, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 1, '222222', 222222, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '测试', 11111111, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (2, 16, '测试', 222222, 1, '2021-03-08 18:56:00', 0, '2021-03-08 18:56:00', 0),
       (1, 0, '测试分类', 1, 0, '2021-04-15 17:55:55', 0, '2021-04-15 17:55:55', 0);

DROP TABLE IF EXISTS `tb_taoduoduo_mall_goods`;



DROP TABLE IF EXISTS `tb_taoduoduo_mall_tag`;

CREATE TABLE `tb_taoduoduo_mall_tag`
(
    `tag_name` varchar(50) NOT NULL DEFAULT '' COMMENT '标签名称',
    PRIMARY KEY (`tag_name`) USING BTREE
) ENGINE = InnoDB
  DEFAULT CHARSET = utf8
  ROW_FORMAT = DYNAMIC;


# 创建商品表

CREATE TABLE `tb_taoduoduo_mall_goods`
(
    `goods_id`        bigint(20) unsigned NOT NULL COMMENT '商品表主键id',
    `goods_name`      varchar(200)        NOT NULL DEFAULT '' COMMENT '商品名',
    `goods_intro`     varchar(200)        NOT NULL DEFAULT '' COMMENT '商品简介',
    `goods_cover_img` varchar(200)        NOT NULL DEFAULT '/admin/dist/img/no-img.png' COMMENT '商品主图',
    `goods_carousel`  varchar(500)        NOT NULL DEFAULT '/admin/dist/img/no-img.png' COMMENT '商品轮播图',
    `goods_detail`    text                NOT NULL COMMENT '商品详情',
    `original_price`  decimal             NOT NULL DEFAULT '1' COMMENT '商品价格',
    `selling_price`   decimal             NOT NULL DEFAULT '1' COMMENT '商品实际售价',
    `stock_num`       int(11) unsigned    NOT NULL DEFAULT '0' COMMENT '商品库存数量',
    `sales_volume`    int(11) unsigned    NOT NULL DEFAULT '0' COMMENT '商品销量',
    `status`          tinyint             NOT NULL DEFAULT '0' COMMENT '商品上架状态 1-下架 0-上架',
    `create_user`     bigint(11) unsigned NOT NULL DEFAULT '0' COMMENT '添加者主键id',
    `create_time`     datetime            NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '商品添加时间',
    `update_user`     bigint(11) unsigned NOT NULL DEFAULT '0' COMMENT '修改者主键id',
    `update_time`     datetime            NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '商品修改时间',
    `category_id`     bigint(20) unsigned NOT NULL COMMENT '分类id',
    `shop_id`         bigint(20) unsigned NOT NULL COMMENT '所属商店id',
    PRIMARY KEY (`goods_id`) USING BTREE
) ENGINE = InnoDB
  DEFAULT CHARSET = utf8
  ROW_FORMAT = DYNAMIC;


DROP TABLE IF EXISTS `tb_taoduoduo_mall_goods_tag`;
CREATE TABLE `tb_taoduoduo_mall_goods_tag`
(
    `id`       bigint(20) unsigned NOT NULL COMMENT '商品标签表主键id',
    `goods_id` bigint(20) unsigned NOT NULL COMMENT '商品表主键id',
    `tag_name` varchar(50)         NOT NULL DEFAULT '' COMMENT '标签名称',
    INDEX `idx_goods_id` (`goods_id`) USING BTREE,
    PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB
  DEFAULT CHARSET = utf8
  ROW_FORMAT = DYNAMIC;


-- for AT mode you must to init this sql for you business database. the seata server not need it.
CREATE TABLE IF NOT EXISTS `undo_log`
(
    `branch_id`     BIGINT       NOT NULL COMMENT 'branch transaction id',
    `xid`           VARCHAR(128) NOT NULL COMMENT 'global transaction id',
    `context`       VARCHAR(128) NOT NULL COMMENT 'undo_log context,such as serialization',
    `rollback_info` LONGBLOB     NOT NULL COMMENT 'rollback info',
    `log_status`    INT(11)      NOT NULL COMMENT '0:normal status,1:defense status',
    `log_created`   DATETIME(6)  NOT NULL COMMENT 'create datetime',
    `log_modified`  DATETIME(6)  NOT NULL COMMENT 'modify datetime',
    UNIQUE KEY `ux_undo_log` (`xid`, `branch_id`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 1
  DEFAULT CHARSET = utf8mb4 COMMENT ='AT transaction mode undo table';